ednieuw/Fibonacci-Nano-ESP32-clock/Old/ESP32ArduinoFibonacci_V006/ESP32ArduinoFibonacci_V006.ino
//--------------------------------------------                                                //
// FIBONACCI Calculate the proper chronological numbers (Pixels)
//--------------------------------------------
void MakeChronoList(byte Hours, byte Minutes,byte Seconds)
{
 Hours %=12;                                                                                  // Keep the hours between 0 and 12
 byte Secsegment = Seconds / 5;
 byte Minsegment = Minutes / 5;
 byte Bit;
 uint32_t Kleur;                                                                              // Color
 for(int i=0; i<12; i++)
  {
   Bit = 0;
   if(i < Hours)        Bit+= 1;                                                              // If hours use the second colour
   if(i < Minsegment)   Bit+= 2;                                                              // If minute use the third colour. If hours was set the fourth colour is displayed 
   if(Mem.NoExUl>0 && i == Secsegment)  Bit = 4;                                              // If second use the fifth colour to display 
   Kleur = colors[Mem.DisplayChoice][Bit];
   if(Mem.NoExUl>1) {if(i<Minutes%5 && Seconds%5<1) Kleur=purple;}                            // If in Ultimate mode
   ColorLed(i,Kleur); 
   }
}
//                                            
//--------------------------------------------                                                //
// FIBONACCI Turn on the right pixels and colours for 24 hour 
//--------------------------------------------
void setPixel(byte pixel, uint32_t kleur)
{
 switch(NUM_LEDS)
 {
  case 12:
        switch(pixel)                                                                         // 12 LEDs 
          {
            case 0:      ColorLeds("", 0, 0,kleur); break;
            case 1:      ColorLeds("", 1, 1,kleur); break;
            case 2:      ColorLeds("", 2, 3,kleur); break;
            case 3:      ColorLeds("", 4, 6,kleur); break;
            case 4:      ColorLeds("", 7,11,kleur); break;
          }
          break;
  case 14:
           switch(pixel)                                                                      // 14 LEDs    
           {
            case 0:      ColorLeds("", 0, 0,kleur); break;
            case 1:      ColorLeds("", 1, 1,kleur); break;
            case 2:      ColorLeds("", 2, 3,kleur); break;
            case 3:      ColorLeds("", 4, 7,kleur); break;
            case 4:      ColorLeds("", 8,13,kleur); break;
           }
          break;
  case 24:
         switch(pixel)                                                                        // 24 LEDs    
          {
            case 0:      ColorLeds("", 0, 1,kleur); break;
            case 1:      ColorLeds("", 2, 3,kleur); break;
            case 2:      ColorLeds("", 4, 7,kleur); break;
            case 3:      ColorLeds("", 8, 13,kleur); break;
            case 4:      ColorLeds("", 14,23,kleur); break;
          }
          break;    
 case 32:
  switch(pixel)                                                                               // for 32 LEDs, 4 strips of 8 LEDs
           {
             case 0:      ColorLeds("", 2, 3,kleur);                            break;
             case 1:      ColorLeds("",12,13,kleur);                            break;
             case 2:      ColorLeds("", 0, 1,kleur); ColorLeds("",14,15,kleur); break;
             case 3:      ColorLeds("",16,19,kleur); ColorLeds("",28,31,kleur); break;
             case 4:      ColorLeds("", 4,11,kleur); ColorLeds("",20,27,kleur); break;
           }
         break;
  case 36:                                                                                      // For case with 3 x 12 LEDs clock 
           switch(pixel)  
          {
            case 0:      ColorLeds("", 0,   2,kleur); break;
            case 1:      ColorLeds("", 3,   5,kleur); break;
            case 2:      ColorLeds("", 6,  11,kleur); break;
            case 3:      ColorLeds("", 12, 20,kleur); break;
            case 4:      ColorLeds("", 21, 35,kleur); break; 
          }
         break;
 case 174:                                                                                     // For 50x50 cm case with 174 LEDs    
         switch(pixel)  
          {
            case 0:      ColorLeds("",  0,   15,kleur); break;
            case 1:      ColorLeds("", 16,   31,kleur); break;
            case 2:      ColorLeds("", 32,   63,kleur); break;
            case 3:      ColorLeds("", 64,  103,kleur); break;
            case 4:      ColorLeds("", 104, 173,kleur); break; 
          }
         break;         
  default:
           switch(pixel)                                                                      // 14 LEDs    
           {
            case 0:      ColorLeds("", 0, 0,kleur); break;
            case 1:      ColorLeds("", 1, 1,kleur); break;
            case 2:      ColorLeds("", 2, 3,kleur); break;
            case 3:      ColorLeds("", 4, 7,kleur); break;
            case 4:      ColorLeds("", 8,13,kleur); break;
           }
          break;
 }  
}

//                                                                                            //
